app/views/sessions/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
            <% if comment.object != "Log" %>
              <li class="logs-message"><%= "#{comment.object} on #{comment.created_at.strftime(("%d/%m/%Y at %H:%M"))} by #{comment.user.firstname}" %>