app/views/contents/index.html.erb

          <ul class="nested">
            <% theme.contents.each do |content| %>
---
SELECT "contents".* FROM "contents"