app/views/contents/new.html.erb

    <%# f.input :intel2, label: 'Intelligence 2', collection: Intelligence.all.each { |intel| intel.name } %>
    <%= f.input :intel1_id, collection: Intelligence.all %>
---
SELECT "intelligences".* FROM "intelligences"