app/views/content_modules/_index.html.erb

SELECT "content_modules".* FROM "content_modules" WHERE "content_modules"."session_id" = $1  [["session_id", 1]]
SELECT "contents".* FROM "contents"
SELECT  1 AS one FROM "content_modules" WHERE "content_modules"."session_id" = $1 LIMIT $2  [["session_id", 1], ["LIMIT", 1]]
---
<div id="items">
  <% if session.content_modules.empty? %>

SELECT "content_modules".* FROM "content_modules" WHERE "content_modules"."session_id" = $1  [["session_id", 1]]
---
  <% else %>
    <% session.content_modules.each do |mod| %>

SELECT  "content_modules".* FROM "content_modules" WHERE "content_modules"."session_id" = $1 AND "content_modules"."position" = $2 ORDER BY "content_modules"."position" ASC LIMIT $3  [["session_id", 5], ["position", 1], ["LIMIT", 1]]
---
    <% else %>
      <% @duration = session.content_modules.find_by(position: (mod.position - 1 )).duration.minutes %>