app/views/content_modules/_mod_card.html.erb

<% @error = false %>
<% @previous = session.content_modules.find_by(position: (mod.position - 1)) %>
---
SELECT  "content_modules".* FROM "content_modules" WHERE "content_modules"."session_id" = $1 AND "content_modules"."position" = $2 ORDER BY "content_modules"."position" ASC LIMIT $3  [["session_id", 5], ["position", 0], ["LIMIT", 1]]

<% exceed = [] %>
<% mod.session.content_modules.each do |mod| %>
---
SELECT "content_modules".* FROM "content_modules" WHERE "content_modules"."session_id" = $1  [["session_id", 1]]
SELECT "contents".* FROM "contents"