app/views/content_modules/create.js.erb


<% @session.content_modules.each do |mod| %>
---
SELECT "content_modules".* FROM "content_modules" WHERE "content_modules"."session_id" = $1  [["session_id", 2]]

  <% else %>
    <% @duration = @session.content_modules.find_by(position: (mod.position - 1 )).duration.minutes %>
---
SELECT  "content_modules".* FROM "content_modules" WHERE "content_modules"."session_id" = $1 AND "content_modules"."position" = $2 ORDER BY "content_modules"."position" ASC LIMIT $3  [["session_id", 1], ["position", 1], ["LIMIT", 1]]