app/views/client_contacts/_edit.html.erb

SELECT "client_companies".* FROM "client_companies" ORDER BY "client_companies"."name" ASC
---
      <%= f.input :role_description, :input_html => { :rows => 5 , :style => 'width: 100%'} %>
      <%= f.input :client_company_id, collection: ClientCompany.all.order(:name) %>