app/views/projects/_edit.html.erb

      <%= f.input :title %>
      <%= f.input :client_contact_id, :collection => ClientContact.all.order(:name), :label_method => :name, :label => 'Client', :include_blank => false %>
---
SELECT "client_contacts".* FROM "client_contacts" ORDER BY "client_contacts"."name" ASC