app/views/projects/show.html.erb

SELECT "users".* FROM "users" INNER JOIN "project_ownerships" ON "users"."id" = "project_ownerships"."user_id" WHERE "project_ownerships"."project_id" = $1  [["project_id", 2]]
---
            <ul id="owner">
              <% @project.users.each do |user| %>