app/controllers/client_companies_controller.rb

  def index
    @client_companies = ClientCompany.all
    @client_companies = policy_scope(ClientCompany).order(name: :asc)
---
SELECT "client_companies".* FROM "client_companies" ORDER BY "client_companies"."id" ASC
SELECT "client_companies".* FROM "client_companies" ORDER BY "client_companies"."name" ASC

  def show
    authorize @client_company
    @client_contacts = ClientContact.where(client_company: @client_company)
---
SELECT "client_contacts".* FROM "client_contacts" WHERE "client_contacts"."client_company_id" = $1  [["client_company_id", 9]]

  def create
    @client_company = ClientCompany.new(clientcompany_params)
    authorize @client_company
    if @client_company.save
---
INSERT INTO "client_companies" ("name", "address", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Test"], ["address", "16, villa Gaudelet 75011 Paris"], ["description", ""], ["created_at", "2019-05-28 10:56:11.028185"], ["updated_at", "2019-05-28 10:56:11.028185"]]

  def set_clientcompany
    @client_company = ClientCompany.find(params[:id])
---
SELECT  "client_companies".* FROM "client_companies" WHERE "client_companies"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]