app/controllers/client_contacts_controller.rb

  def create
    @client_contact = ClientContact.new(clientcontact_params)
    @client_company = ClientCompany.find(params[:client_company_id])
    authorize @client_contact
    @client_contact.client_company = @client_company
    if @client_contact.save
---
SELECT  "client_companies".* FROM "client_companies" WHERE "client_companies"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
INSERT INTO "client_contacts" ("name", "email", "title", "role_description", "client_company_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    @companies = ClientCompany.all
    authorize @client_contact
    @client_contact.update(clientcontact_params)
---
UPDATE "client_contacts" SET "client_company_id" = $1, "updated_at" = $2 WHERE "client_contacts"."id" = $3  [["client_company_id", 4], ["updated_at", "2019-05-28 12:53:15.033745"], ["id", 1]]

  def destroy
    @client_contact.destroy
---
DELETE FROM "client_contacts" WHERE "client_contacts"."id" = $1  [["id", 1]]

  def set_clientcontact
    @client_contact = ClientContact.find(params[:id])
---
SELECT  "client_contacts".* FROM "client_contacts" WHERE "client_contacts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]