app/controllers/client_contacts_controller.rb

SELECT "client_contacts".* FROM "client_contacts" ORDER BY "client_contacts"."name" ASC
---
  def index
    @client_contacts = ClientContact.all
    @client_contacts = policy_scope(ClientContact).order(name: :asc)

SELECT "client_companies".* FROM "client_companies"
---
  def new
    @client_contact = ClientContact.new
    @companies = ClientCompany.all