app/controllers/content_modules_controller.rb

  def new
    @content = Content.find(params[:content_id])
---
SELECT  "contents".* FROM "contents" WHERE "contents"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @content = Content.find(params[:content_id])
    @content_module = ContentModule.new(content_module_params)
    authorize @content_module
    @content_module.content = @content
    if @content_module.save
---
SELECT  "contents".* FROM "contents" WHERE "contents"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "content_modules" ("title", "format", "duration", "description", "session_id", "chapter", "position", "intel1_id", "intel2_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"

  def update
    authorize @content_module
    @content = @content_module.content
    @content_module.update(content_module_params)
    if @content_module.save
---
UPDATE "content_modules" SET "position" = ("content_modules"."position" - 1), "updated_at" = '2019-05-31 08:32:33.119867' WHERE "content_modules"."session_id" = $1 AND ("content_modules"."position" > 1)  [["session_id", 1]]

  def destroy
    authorize @content_module
    @content = Content.find(params[:content_id])
    @content_module.destroy
---
DELETE FROM "content_modules" WHERE "content_modules"."id" = $1  [["id", 1]]

  def move_up
    authorize @content_module
    @content = @content_module.content
    array = []
    @content.content_modules.order('position ASC').each do |mod|
      array << mod
    end
    unless @content_module.position == 1
      array.insert((@content_module.position - 2), array.delete_at(@content_module.position - 1))
    end
    array.compact.each do |mod|
      mod.update(position: array.index(mod) + 1)
---
UPDATE "content_modules" SET "position" = ("content_modules"."position" - 1), "updated_at" = '2019-05-31 11:55:59.218669' WHERE "content_modules"."session_id" = $1 AND ("content_modules".id != 23) AND ("content_modules"."position" > 1) AND ("content_modules"."position" <= 2)  [["session_id", 3]]

  def set_content_module
    @content_module = ContentModule.find(params[:id])
---
SELECT  "content_modules".* FROM "content_modules" WHERE "content_modules"."id" = $1 LIMIT $2 FOR UPDATE  [["id", 23], ["LIMIT", 1]]