app/controllers/contents_controller.rb

  def index
    @contents = Content.all
---
SELECT "contents".* FROM "contents"

  def new
    @content = Content.new
    @intelligences = Intelligence.all
---
SELECT "intelligences".* FROM "intelligences"

  def create
    @content = Content.new(content_params)
    @intelligence_content1 = IntelligenceContent.new(intelligence_id: @content.intel1, content: @content)
    @intelligence_content2 = IntelligenceContent.new(intelligence_id: @content.intel2, content: @content)
    authorize @content
    if @content.save && @intelligence_content1.save && @intelligence_content2.save
---
INSERT INTO "contents" ("title", "format", "duration", "description", "logistic", "chapter", "intel1", "intel2", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
INSERT INTO "intelligence_contents" ("intelligence_id", "content_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["intelligence_id", 1], ["content_id", 3], ["created_at", "2019-05-27 15:58:04.530935"], ["updated_at", "2019-05-27 15:58:04.530935"]]

  def update
    authorize @content
    @content.update(content_params)
---
UPDATE "contents" SET "title" = $1, "chapter" = $2, "updated_at" = $3 WHERE "contents"."id" = $4  [["title", "Test3"], ["chapter", "Business Development"], ["updated_at", "2019-05-27 14:03:24.410278"], ["id", 2]]

  def destroy
    @content.destroy
---
DELETE FROM "contents" WHERE "contents"."id" = $1  [["id", 1]]

  def set_content
    @content = Content.find(params[:id])
---
SELECT  "contents".* FROM "contents" WHERE "contents"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]