app/controllers/content_modules_controller.rb

SELECT  "content_modules".* FROM "content_modules" WHERE "content_modules"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_module
    @module = ContentModule.find(params[:id])