app/controllers/intelligences_controller.rb

  def index
    @intelligences = Intelligence.all
---
SELECT "intelligences".* FROM "intelligences" ORDER BY "intelligences"."created_at" DESC

  def create
    @intelligence = Intelligence.new(intelligence_params)
    if @intelligence.save
---
INSERT INTO "intelligences" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Test"], ["description", "Blobi"], ["created_at", "2019-05-27 13:37:18.714297"], ["updated_at", "2019-05-27 13:37:18.714297"]]

  def update
    @intelligence.update(intelligence_params)
    if @intelligence.save
---
UPDATE "intelligences" SET "name" = $1, "updated_at" = $2 WHERE "intelligences"."id" = $3  [["name", "Intelligence"], ["updated_at", "2019-05-27 10:50:38.613167"], ["id", 1]]

  def destroy
    @intelligence.destroy
---
DELETE FROM "intelligences" WHERE "intelligences"."id" = $1  [["id", 2]]

  def set_intelligence
    @intelligence = Intelligence.find(params[:id])
---
SELECT  "intelligences".* FROM "intelligences" WHERE "intelligences"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]