app/controllers/projects_controller.rb

SELECT "users".* FROM "users"
---
  def show
    authorize @project
    @project_ownership = ProjectOwnership.new
    @users = User.all

SELECT "client_contacts".* FROM "client_contacts"
---
  def new
    @project = Project.new
    @project_ownership = ProjectOwnership.new
    @clients = ClientContact.all

INSERT INTO "project_ownerships" ("user_id", "project_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 2], ["project_id", 1], ["created_at", "2019-05-29 14:38:52.008663"], ["updated_at", "2019-05-29 14:38:52.008663"]]
INSERT INTO "projects" ("title", "start_date", "end_date", "client_contact_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Test"], ["start_date", "2019-06-01"], ["end_date", "2019-06-02"], ["client_contact_id", 1], ["created_at", "2019-05-31 08:26:00.080914"], ["updated_at", "2019-05-31 08:26:00.080914"]]
---
  def create
    @project = Project.new(project_params)
    @project_ownership = ProjectOwnership.new(user: current_user, project: @project)
    authorize @project
    if @project.save && @project_ownership.save