app/controllers/project_ownerships_controller.rb

  def create
    @user = User.find(params[:project_ownership][:user].to_s)
    @project = Project.find(params[:project_id])
    @ownership = ProjectOwnership.new(user: @user, project: @project)
    skip_authorization
    if @ownership.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "project_ownerships" ("user_id", "project_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["project_id", 1], ["created_at", "2019-05-29 10:53:48.608249"], ["updated_at", "2019-05-29 10:53:48.608249"]]