app/controllers/sessions_controller.rb

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def index
    @project = Project.find(params[:project_id])

SELECT "contents".* FROM "contents"
---
  def show
    @session = Session.find(params[:id])
    authorize @session
    @contents = Content.all
    @comment = Comment.new
    @chapter = []
    @contents.each do |content|

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def new
    @session = Session.new
    # @clients = ClientContact.all
    @project = Project.find(params[:project_id])

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def create
    @project = Project.find(params[:project_id])