app/controllers/users_controller.rb

  def index
    @users = User.all
    @users = policy_scope(User).order(:name)
---
SELECT "users".* FROM "users"
SELECT "users".* FROM "users" ORDER BY "users"."name" ASC

  def create
    @user = User.new(user_params)
    authorize @user
    if @user.save
---
INSERT INTO "users" ("email", "encrypted_password", "name", "access_level", "picture", "linkedin", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def update
    authorize @user
    @user.update(user_params)
---
UPDATE "users" SET "encrypted_password" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["encrypted_password", "$2a$11$K0iq09WWczbMtzcNyZVzVOnd.kWmsV0DWxRXr1Gt2LmhKF/ATCtFS"], ["updated_at", "2019-05-29 09:54:18.508344"], ["id", 4]]